{"batchcomplete":"","query":{"normalized":[{"from":"Cochise_County,_Arizona","to":"Cochise County, Arizona"}],"pages":{"87932":{"pageid":87932,"ns":0,"title":"Cochise County, Arizona","extract":"Cochise County ( koh-CHEESS) is a county in the southeastern corner of the U.S. state of Arizona. It is named after Cochise, a Chiricahua Apache, who was a key war leader during the Apache Wars.\nIts population was 125,447 at the 2020 census. The county seat is Bisbee and the most populous city is Sierra Vista.\nCochise County includes the Sierra Vista-Douglas, Arizona metropolitan statistical area. The county borders southwestern New Mexico and the northwestern Mexican state of Sonora.\n\n\n== History ==\n\nIn 1528, Spanish explorers Álvar Núñez Cabeza de Vaca, Estevanico, and Fray Marcos de Niza survived a shipwreck off the Texas coast. Captured by Native Americans, they spent eight years finding their way back to Mexico City, via the San Pedro Valley. Their journals, maps, and stories led to the Cibola, seven cities of gold myth. The Expedition of Francisco Vásquez de Coronado in 1539 using it as his route north through what they called the Guachuca Mountains of Pima (Tohono O'odham) lands and later part of the mission routes north, but was actually occupied by the Sobaipuri descendants of the Hohokam. They found a large Pueblo (described as a small city) between modern Benson and Whetstone, and several smaller satellite villages and smaller pueblos including ones on Fort Huachuca, Huachuca City, and North Eastern Fry. About 1657, Father Kino visited the Sobaipuris just before the Apache forced most from the valley, as they were struggling to survive due to increasing Chiricahua Apache attacks as they moved into the area of Texas Canyon of the Dragoon Mountains. In 1775, Presidio Santa Cruz de Terrenate was founded on the west bank of the San Pedro River to protect the natives and the Mexican settlers who supplied the mission stations. The presidio was chronically short on provisions due to raids, however, and lacked personnel to adequately patrol the eastern route due to wars with France and England, so the main route north shifted west to the Santa Cruz Valley, farther from the range of the Chiricahua Apache, who almost exclusively controlled the area by 1821.\n\nCochise County was created on February 1, 1881, out of the eastern portion of Pima County. It took its name from the Chiricahua Apache war chief Cochise.  The county seat was Tombstone until 1929, when it moved to Bisbee. Notable men who once held the position of county sheriff were Johnny Behan, who served as the first sheriff of the new county, and who was one of the main characters during the events leading to and following the gunfight at the O.K. Corral. Later, in 1886, Texas John Slaughter became sheriff. Lawman Jeff Milton and lawman/outlaw Burt Alvord both served as deputies under Slaughter.\nA syndicated television series that aired from 1956 to 1958, The Sheriff of Cochise starring John Bromfield, was filmed on location in Cochise County. The Jimmy Stewart movie Broken Arrow and subsequent television show of the same name starring John Lupton, which also aired from 1956 to 1958, were set in Cochise County, but filmed at other locations.\nJ.A. Jance's Joanna Brady mystery series takes place in Cochise County, where Brady is sheriff.\nBeginning in the late 1950s, the small community of Miracle Valley was the site of a series of bible colleges and similar religious organizations, founded by television evangelist A. A. Allen. In 1982, Miracle Valley and neighboring Palominas were the site of a series of escalating conflicts between a newly arrived black religious community and the county sheriff and deputies that culminated in the Miracle Valley shootout.\n\n\n== Geography ==\nAccording to the United States Census Bureau, the county has a total area of 6,219 square miles (16,110 km2), of which 53 square miles (140 km2) (0.9%) are covered by water. Cochise County is close to the size of the states of Rhode Island and Connecticut combined.\n\n\n=== Adjacent counties and municipios ===\n\n\n=== Protected areas ===\n\nChiricahua National Monument\nCoronado National Forest (part)\nCoronado National Memorial\nFort Bowie National Historic Site\nKartchner Caverns State Park\nLeslie Canyon National Wildlife Refuge\nSan Pedro Riparian National Conservation Area\n\n\n== Demographics ==\n\n\n=== Racial and ethnic composition ===\n\n\n=== 2020 census ===\nAs of the 2020 census, the county had a population of 125,447. Of the residents, 20.8% were under the age of 18 and 24.2% were 65 years of age or older; the median age was 44.0 years. For every 100 females there were 100.7 males, and for every 100 females age 18 and over there were 100.7 males. 63.2% of residents lived in urban areas and 36.8% lived in rural areas.\nThe racial makeup of the county was 65.2% White, 3.8% Black or African American, 1.2% American Indian and Alaska Native, 2.2% Asian, 0.4% Native Hawaiian and Pacific Islander, 10.1% from some other race, and 17.2% from two or more races. Hispanic or Latino residents of any race comprised 34.0% of the population, as detailed in the table below.\nThere were 50,936 households in the county, of which 25.8% had children under the age of 18 living with them and 26.9% had a female householder with no spouse or partner present. About 31.2% of all households were made up of individuals and 15.9% had someone living alone who was 65 years of age or older.\nThere were 58,648 housing units, of which 13.1% were vacant. Among occupied housing units, 68.8% were owner-occupied and 31.2% were renter-occupied. The homeowner vacancy rate was 2.7% and the rental vacancy rate was 10.0%.\n\n\n=== 2010 census ===\nAs of the census of 2010,  131,346 people, 50,865 households, and 33,653 families resided in the county. The population density was 21.3 inhabitants per square mile (8.2 inhabitants/km2). The 59,041 housing units had an average density of 9.6 units per square mile (3.7 units/km2). The racial makeup of the county was 78.5% White, 4.2% Black or African American, 1.9% Asian, 1.2% American Indian, 0.3% Pacific islander, 9.9% from other races, and 4.0% from two or more races. Those of Hispanic or Latino origin made up 32.4% of the population. The largest ancestry groups were:\n\nOf the 50,865 households, 30.4% had children under 18 living with them, 50.0% were married couples living together, 11.5% had a female householder with no husband present, 33.8% were not families, and 28.2% were made up of individuals. The average household size was 2.46 and the average family size was 3.02. The median age was 39.7 years.\nThe median income for a household in the county was $44,876 and for a family was $53,077. Males had a median income of $42,164 versus $31,019 for females. The per capita income for the county was $23,010. About 11.8% of families and 15.7% of the population were below the poverty line, including 23.2% of those under 18 and 10.7% of those 65 or over.\n\n\n=== 2000 census ===\nAs of the census of 2000,  117,755 people, 43,893 households, and 30,768 families were residing in the county. The population density was 19 people per square mile (7.3 people/km2). The 51,126 housing units had an average density of 8 units per square mile (3.1 units/km2). The racial makeup of the county was 76.7% White, 4.5% African American, 1.2% Native American, 1.7% Asian, 0.3% Pacific Islander, 12.1% from other races, and 3.7% from two or more races. About 30.7% of the population were Hispanics or Latino of any race. Around 25.4% reported speaking Spanish at home, while 1.3% spoke German.\n\nThere were 43,893 households, out of which 32.0% had children under the age of 18 living with them, 55.1% were married couples living together, 11.1% had a female householder with no husband present, and 29.9% were non-families. 25.3% of all households were made up of individuals, and 10.1% had someone living alone who was 65 years of age or older. The average household size was 2.55 and the average family size was 3.07.\nIn the county, the population was spread out, with 26.3% under the age of 18, 9.3% from 18 to 24, 26.0% from 25 to 44, 23.7% from 45 to 64, and 14.7% who were 65 years of age or older. The median age was 37 years. For every 100 females there were 101.60 males. For every 100 females age 18 and over, there were 101.20 males.\nThe median income for a household in the county was $32,105, and the median income for a family was $38,005. Males had a median income of $30,533 versus $22,252 for females. The per capita income for the county was $15,988. About 13.5% of families and 17.7% of the population were below the poverty line, including 25.8% of those under age 18 and 10.4% of those age 65 or over.\nIn 2000, the largest denominational groups were the Catholics (with 25,837 adherents) and Evangelical Protestants (with 12,548 adherents). The largest religious bodies were the Catholic Church (with 25,837 members) and the Southern Baptist Convention (with 5,999 members).\n\n\n== Politics ==\nCochise County leans strongly towards the Republican Party in presidential elections. Although Bill Clinton carried the county narrowly in 1992, it has supported the Republican nominee by large margins in every other election since 1968, except for 1996 and 1976 when Clinton and Jimmy Carter each lost only narrowly. Although the county includes the relatively liberal town of Bisbee, as well as the city of Douglas which has a large Latino population, this is outweighed by the heavily Republican tilt of the more populous Sierra Vista, which is adjacent to Fort Huachuca and thus has a heavy military presence.\n\nIn the United States House of Representatives, the county is mostly part of Arizona's 6th congressional district, which is represented by Republican Juan Ciscomani. In the Arizona Legislature, the county is part of the 19th district and is represented by Republican David Gowan in the State Senate and Republicans Gail Griffin and Lupe Diaz in the State House of Representatives. This district also includes the entirety of Greenlee County, as well as portions of Pima County, Graham County, and Santa Cruz County.\n\n\n== Transportation ==\n\n\n=== Major highways ===\n\n Interstate 10\n Historic U.S. Route 80\n U.S. Route 191\n State Route 80\n State Route 82\n State Route 83\n State Route 90\n State Route 92\n State Route 186\n\n\n=== Airports ===\nBisbee Municipal Airport is owned by the City of Bisbee and located five nautical miles (9 km) southeast of its central business district\nSierra Vista Municipal Airport (IATA: FHU, ICAO: KFHU, FAA LID: FHU), a joint-use civil-military airport which shares facilities with Libby Army Airfield, is located on the U.S. Army installation Fort Huachuca in the city of Sierra Vista. The airport has three runways and one helipad. It is mostly used for military aviation for the surrounding military base.\nNo commercial flights occur at Cochise County; the nearest commercial airport is at Tucson, about 70 miles from Sierra Vista.\n\n\n== Communities ==\n\n\n=== Cities ===\nBenson\nBisbee (county seat)\nDouglas\nSierra Vista\nTombstone\nWillcox\n\n\n=== Towns ===\nHuachuca City\n\n\n=== Census-designated places ===\n\n\n=== Other places ===\n\n\n=== Military sites ===\nFort Huachuca\nWillcox Playa (proving ground)\n\n\n=== Ghost towns ===\n\n\n=== County population ranking ===\nThe population ranking of the following table is based on the 2010 census of Cochise County.\n† county seat\n\n\n== Education ==\nSchool districts include:\nUnified:\n\nSecondary:\n\nValley Union High School District\nElementary:\n\nThe Rucker Elementary School district, in 2002, operated no schools and sent its elementary students to the Elfrida district. The Rucker district had a bus driver and an administrator as employees. The residents liked the arrangement as they could pay less tax.\n\n\n== See also ==\n\nNational Register of Historic Places listings in Cochise County, Arizona\nSan Pedro Valley Observatory\n\n\n== References ==\n\n\n== External links ==\nCounty website\nOfficial Tourism Council Site"}}}}