{"batchcomplete":"","query":{"normalized":[{"from":"Cochise_College","to":"Cochise College"}],"pages":{"4702114":{"pageid":4702114,"ns":0,"title":"Cochise College","extract":"Cochise College is a public college in Arizona. Founded on September 21, 1964, the school has campuses in Douglas and Sierra Vista, and centers in Benson, Fort Huachuca, and Willcox. Cochise College offers associate degrees in art, applied science, business, elementary education, general studies, and science, and over 30 different certificate programs. The college also offers transfer programs for students to transfer to partner universities.\n\n\n== History ==\nCochise College was one of the first community colleges in Arizona when it was founded on September 21, 1964. The college was voted on by the citizens of Cochise County in 1961 and a 1962 bond election resulted in the construction of the Douglas Campus. With the increased growth and interest in secondary education, a second campus was opened in Sierra Vista. The new campus was originally housed in a few temporary buildings on the grounds of Buena High School in the early 1970s but opened a full scale college campus in 1978.\nIn December 2024, James Perey, EdD, was selected to serve as the 12th president of Cochise College, effective February 2025.\nIn 2025, Cochise College was ranked as the top community college in Arizona and 38th in the United States in a 2025 study by financial technology firm SmartAsset, which evaluated 585 institutions.\n\n\n== Campus ==\nCochise College is accredited by the Higher Learning Commission of the North Central Association. The college holds memberships in the Arizona Community College Association, the Council of North Central Two-Year Colleges, the American Association of Community Colleges, the Council for Higher Education Accreditation, the Hispanic Association of Colleges and Universities and the Association of Community College Trustees.\nThe college also holds Federal Aviation Administration certification for its professional pilot and aviation maintenance programs and Arizona Department of Health Services/Emergency Medical Services certification for its paramedicine and emergency medical technology programs. The nursing program is accredited by the Arizona State Board of Nursing and the Accreditation Commission for Education in Nursing.\nThe Cochise College Library system consists of two branches, the Charles Di Peso Library on the Douglas campus and the Andrea Cracchiolo Library on the Sierra Vista campus. The libraries maintain a collection of over 60,000 books and media items, including DVDs and audiobooks, to support Cochise College curriculum and lifelong learning. The Cochise College Online Library provides access to more than 8,700 magazines and scholarly journals, eBook collections containing over 100,000 titles, and 20,000 plus streaming videos.\nThe school is noted for having its own school-owned airport, built specifically for the college's aviation program.\nIn June 2021, the college administration signed a license agreement with U.S. Customs and Border Protection (CBP) to allow the U.S. Border Patrol to erect an 80-foot tall, relocatable surveillance tower on the college's Douglas campus. The agreement does not require CBP to compensate the college for use of the site, and does not include an end date for the agreement (although the college can revoke the agreement at any time with 60 days notice). The tower, called a Relocatable Long-Range Surveillance Tower or an Intelligence Relocatable Long-Range Surveillance Tower, is a relocatable version of the Border Patrol's Integrated Fixed Tower (IFT) system. Like the standard IFTs, the tower was manufactured by Elbit Systems of America, the U.S. subsidiary of the Israeli military technology company. It is equipped with electro-optical and infrared cameras as well as radar, and has a maximum effective range of 5-7.5 miles. The tower is located at 31.36339049, -109.682431.\n\n\n== Organization and administration ==\nThe college contains seven campuses and centers, each with its known founding date:\n\n\n== Academics ==\nCochise College offers 49 Undergraduate Associate Degrees in total.\nAssociate of Arts\n\nAssociate of Arts Elementary Education\n\nElementary Education\nAssociate of Business\n\nAssociate of Science\n\nAssociate of General Studies\n\nAssociate of Applied Science\n\n\n== Research ==\n\n\n=== Endowment ===\nAs of June 2019, the Board of Directors has designated $585,071 of net assets without donor restrictions as a general endowment fund to support the mission of the Cochise College Foundation.\n\n\n== Student life ==\n\n\n=== On-Campus Housing ===\nCochise College – Douglas Campus has traditional residence halls (dorms) and town homes that can house up to 180 residents each semester.  The college welcomes students from around the state, country and world to the rural on-campus community. Students enrolled in at least 12 credits may reside on campus.  More information may be found at the college's website.\n\n\n== Athletics ==\n\nCochise College offers several intramural sports programs available to the student body. These include Men's and Women's Basketball, Soccer, Baseball, and Rodeo.\n\n\n=== Women's Basketball ===\nThe members of Women's basketball team at Cochise College have been awarded multiple honors to include All National Junior College Athletic Association (NJCAA) Region 1 Division 1 honors, All Arizona Community College Athletic Conference (ACCAC) honors, All American honors, and Academic All American honors.\n\n\n==== Accomplishments ====\n1984–1985 Season – Record: 25–6 (ACCAC Champions, Region 1 Champions, NJCAA National Tournament Appearance)\n2004–2005 Season – Record: 19–10 (Region 1 Runners-Up)\n2005–2006 Season – Record: 16–16 (Region 1 Runners-Up)\n2012–2013 Season – Record: 26–6 (Region 1 Runners-Up)\n2016–2017 Season – Record: 28–4 (Region 1 Champions, ACCAC Champions, NJCAA National Tournament Appearance)\n2017–2018 Season – Record: 29–3 (Region 1 Champions, ACCAC Champions, NJCAA National Tournament Appearance)\n2018–2019 Season – Record: 28–4 (Region 1 Champions, ACCAC Champions, NJCAA National Tournament Appearance)\n\n\n=== Men's Baseball ===\nThe members of Men's baseball team at Cochise College have been awarded multiple honors to include All American honors, All Region honors, and All ACCAC honors, and Academic All American honors.\n\n\n==== Accomplishments ====\n2014 Season: Western District Champions, Advanced to NJCAA World Series\n\n\n== People ==\n\n\n=== Notable faculty and staff ===\nJames A. Corbett born 1933, former librarian and Philosophy Professor, human rights activist and a co-founder of the Sanctuary movement\nMarsha Arzberger born 1937, Foundation Board member since 1999, former Arizona State Senator\n\n\n=== Notable alumni and students ===\nBeau Allred (born 1965), former American professional baseball player\nBrayon Blake (born 1995), American professional basketball player for the Manisa Büyükşehir Belediye of the Turkish 2nd Division\nChad Curtis (born 1968), former American professional baseball player\nCharles DeBarber, cyber threat intelligence and computer security professional\nEric Gonzalez (born 1986), former Spanish professional baseball player\nKevin Kouzmanoff (born 1981), former American professional baseball player, current hitting coach in the Oakland Athletics\nDavid Lundquist (born 1973), former American professional baseball player, current assistant pitching coach for the Philadelphia Phillies\nCarolyne Mas (born 1955), singer-songwriter, guitarist, pianist, and producer\nYemiyah Morris (born 1998), American basketball player\nNathan Sobey (born 1990), Australian professional basketball player for the Brisbane Bullets of the National Basketball League (NBL)\nLaCosta Tucker (born 1951), American country music artist\n\n\n== See also ==\nCochise College Airport\n\n\n== References =="}}}}