{"batchcomplete":"","query":{"normalized":[{"from":"Fort_Huachuca","to":"Fort Huachuca"}],"pages":{"1744158":{"pageid":1744158,"ns":0,"title":"Fort Huachuca","extract":"Fort Huachuca is a United States Army installation in Cochise County in southeast Arizona, approximately 15 miles (24 km) north of the border with Mexico and at the northern end of the Huachuca Mountains, adjacent to the town of Sierra Vista. Established on 3 March 1877 as Camp Huachuca, the garrison is under the command of the United States Army Installation Management Command. From 1913 to 1933, the fort was the base for the \"Buffalo Soldiers\" of the 10th Cavalry Regiment. During the build-up of World War II, the fort had quarters for more than 25,000 male soldiers and hundreds of WACs. In the 2010 census, Fort Huachuca had a population of about 6,500 active duty soldiers, 7,400 military family members, and 5,000 civilian employees. Fort Huachuca has over 18,000 people on post during weekday work hours.\nThe major tenant units are the United States Army Network Enterprise Technology Command (NETCOM) and the United States Army Intelligence Center. Libby Army Airfield is on post and shares its runway with Sierra Vista Municipal Airport. It was an alternate but never used landing location for the Space Shuttle. Fort Huachuca is the headquarters of Army Military Auxiliary Radio System. Other units include the Joint Interoperability Test Command, the Information Systems Engineering Command, the Electronic Proving Ground (USAEPG), and the Intelligence and Electronic Warfare Directorate.\nThe fort has a radar-equipped aerostat (Tethered Aerostat Radar System), one of a series maintained for the Drug Enforcement Administration (DEA) by Harris Corporation. The aerostat is northeast of Garden Canyon and supports the DEA drug interdiction mission by detecting low-flying aircraft attempting to enter the United States from Mexico. Fort Huachuca contains the Western Division of the Advanced Airlift Tactics Training Center which is based at the 139th Airlift Wing, Rosecrans Air National Guard Base in Saint Joseph, Missouri.\n\n\nHistory\n\nThe installation was founded to counter the Chiricahua Apache threat and secure the border with Mexico during the Apache Wars. On 3 March 1877, Captain Samuel Marmaduke Whitside led two companies of the 6th Cavalry and chose a site at the base of the Huachuca Mountains that provided sheltering hills and a perennial stream. In 1882, Camp Huachuca was redesignated a fort.\n\nGeneral Nelson A. Miles commanded Fort Huachuca as his headquarters in his campaign against Geronimo in 1886. After the surrender of Geronimo in 1886, the Apache threat was extinguished, but the army continued to operate Fort Huachuca because of its strategic border position. In 1913, the fort became the base for the \"Buffalo Soldiers\", the 10th Cavalry Regiment composed of African Americans. It served this purpose for twenty years. During General Pershing's failed Punitive Expedition of 1916–1917, he used the fort as a forward logistics and supply base. From 1916 to 1917, the base was commanded by Charles Young, the first African American to be promoted to colonel. He left for medical reasons. In 1933, the 25th Infantry Regiment replaced the 10th Cavalry at the fort.\nWith the build-up during World War II, the fort had an area of 71,253 acres (288.35 km2), with quarters for 1,251 officers and 24,437 enlisted soldiers. The 92nd and 93rd Infantry Divisions, composed of African-American troops, trained at Huachuca.\n\nIn 1947, the post was closed and turned over to the Arizona Game and Fish Department. At the outbreak of the Korean War, a January 1951 letter from the Secretary of the Air Force to the Governor of Arizona invoked the reversion clause of a 1949 deed. On 1 February 1951 the U.S. Air Force took official possession of Fort Huachuca, making it one of the few army installations to have had an existence as an air base. The army retook possession of the base a month later and reopened the post in May 1951 to train engineers in airfield construction as part of the Korean War build up. The engineers built today's Libby Army Airfield, named in honor of Korean War Medal of Honor recipient George D. Libby. On 1 May 1953, after the Korean War, the post was again placed on inactive status with only a caretaker detachment.\n\nOn 1 February 1954, Huachuca was reactivated after a seven-month shut-down following the Korean War. It was the beginning of a new era focused on electronic warfare. The army's Electronic Proving Ground opened in 1954, followed by the Army Security Agency Test and Evaluation Center in 1960, the Combat Surveillance and Target Acquisition Training Command in 1964, and the Electronic Warfare School in 1966. Also in 1966 the U.S. Army established the 1st Combat Support Training Brigade, whose mission was to train soldiers in the specialties of field wire and communication, telegraph communications (O5B wired and wireless), light tactical vehicle driving, wheeled vehicle maintenance, and food service and administration due to the expanding need for these skills in Vietnam.\nIn 1967, Fort Huachuca became the headquarters of the U.S. Army Strategic Communications Command, which became the U.S. Army Communications Command in 1973, and U.S. Army Information Systems Command in 1984. It is now known as NETCOM after the army dropped the 9th Signal Command (Army) designation on 1 October 2011. NETCOM was realigned in 2014 as a subordinate command to United States Army Cyber Command from a direct reporting unit to the Headquarters, Department of the Army CIO/G6.\nFort Huachuca was declared a National Historic Landmark in 1976 for its role in ending the Apache Wars, the last major military actions against Native Americans, and as the site of the Buffalo Soldiers. Fort Huachuca includes a cemetery known as the Fort Huachuca Post Cemetery. Some 3,800 veterans and family members are buried there.\n\nIn 1980, the 160th Special Operations Aviation Regiment (SOAR) conducted aircraft training exercises from Fort Huachuca in preparation for Operation Honey Badger. This operation aimed to rescue captive American personnel in Iran. It was developed in the wake of Operation Eagle Claw's failure. The environment near the fort enabled 160th SOAR pilots to train and simulate flying in the mountainous desert terrain of Iran.\nThe fort was the site of the 2007 Conseil International du Sport Militaire.\n\n\nMuseums\n\nFort Huachuca has two museums in three buildings on post. The Ft. Huachuca Museum occupies two buildings on Old Post, its main museum and gift shop (Building 41401), and a nearby spillover gallery called the Museum Annex (building 41305). It tells the story of Fort Huachuca and the U.S. Army in the American Southwest, with special emphasis on the Buffalo Soldiers and the Apache War. The Annex across the street (Old Post Theater) has outdoor displays, walkways, sitting areas, and historical statues.\nThe second museum is The U.S. Army Intelligence Museum, in the military intelligence (MI) Library on the MI school campus (Hatfield Street – Building 62723). The museum has a collection of historical artifacts including agent radio communication gear, aerial cameras, cryptographic equipment, an Enigma Code machine, two small drones and a section of the Berlin Wall. The museum's emphasis is on U.S. Army military intelligence history and includes displays of the organizational development of army intelligence. There is a small military intelligence gift shop with customized Fort Huachuca souvenirs.\nAll visitors, military or civilian, are welcome at the Ft. Huachuca Museum free of charge. Civilian visitors without a DoD ID card must pass a criminal background check before being allowed to pass the gate. Foreign visitors must be escorted by active duty or retired military personnel.\n\n\nSignal Commands\nFort Huachuca has a rich tradition in Army Signal and is currently home to NETCOM whose mission is to plan, engineer, install, integrate, protect, defend and operate army cyberspace, enabling mission command through all phases of operations. It used to be home to the 11th Signal Brigade. The 11th Signal Brigade has the mission of rapidly deploying worldwide to provide and protect command, control, communications, and computer support for commanders. They were deployed to provide signal operations during the 2003 invasion of Iraq. On 7 June 2013, the unit moved to Fort Hood, Texas. The Army Electronic Proving Ground (USAEPG), a forerunner in the research and development of defense technology, was conducted at Ft. Huachuca for several decades. The software-defined radios, Wideband Networking Waveform, and the Soldier Radio Waveform, were tested at USAEPG in 2014 for a network integration evaluation, NIE 15.2, at Fort Bliss, in 2015.\n\n\nMilitary Intelligence\nIn addition to the US Army Intelligence Center, Fort Huachuca is the home of the 111th Military Intelligence Brigade, which conducts MI training for the armed services. The Military Intelligence Officer Basic Leadership Course, Military Intelligence Captain's Career Course, and the Warrant Officer Basic and Advanced Courses are taught on the installation. The Army's MI branch also held the responsibility for unmanned aerial vehicles until April 2006.  The program was reassigned to the Aviation branch's 1st Battalion, 210th Aviation Regiment, now 2nd Battalion, 13th Aviation Regiment.  Additional training in Human Intelligence (e.g., interrogation, counterintelligence), Imagery Intelligence, and Electronic Intelligence and analysis is also conducted by the 111th. The 111th MI Brigade hosts the Joint Intelligence Combat Training Center at Fort Huachuca.\n\n\nEducation\nFort Huachuca Accommodation Schools is the school district for dependent children living on the base. The schools are: Colonel Johnston Elementary School (K–2), General Myer Elementary School (3–5), and Colonel Smith Middle School (6–8). The zoned high school is Buena High School, operated by the Sierra Vista Unified School District, in Sierra Vista.\n\n\nNotable people\n\nPeople who have served or lived at Fort Huachuca:\n\nBrigadier General Samuel Whitside, founded Camp Huachuca.\nMajor General Leonard Wood, Medal of Honor recipient and Chief of Staff of the Army from 1910 to 1914 (after whom Fort Leonard Wood in Missouri is named).\nColonel Cornelius C. Smith, Medal of Honor recipient and head of the Philippine Constabulary from 1910 to 1912. He accepted surrender of Mexican Colonel Emilio Kosterlitzky while stationed at Huachuca in 1913 and was later Huachuca commandant from 1918 to 1919.\nBullet Rogan (Negro league baseball) 25th Infantry Regiment\nCornelius C. Smith Jr., historian of Arizona, California, and the Southwestern United States.\nJohn Henry, played professional baseball for the Washington Senators and Boston Braves from 1910 to 1918.\nColonel Sidney Mashbir, Commandant of Allied Translator and Interpreter Section, Military Intelligence Service during World War II.\nGeneral Alexander Patch, decorated officer who commanded Army and Marine forces in the Guadalcanal campaign and later the 7th Army in Europe during World War II.\nGeneral James Gavin (82nd Airborne Division)\nGeneral Robert Sink (101st Airborne Division)\nLieutenant General Sidney T. Weinstein, one of the driving forces behind reorganizing Army intelligence in late 1970s and 1980s.\nCaptain Amadou Sanogo, junta leader in the West African country of Mali, completed intelligence training at Fort Huachuca in 2008.\nSpecialist 5 Bobby Murcer, Major League Baseball player, New York Yankees, 1967–1969. 1st Training Brigade.\nLuis Robles, goalkeeper for the New York Red Bulls of Major League Soccer, was born at Fort Huachuca in 1984.\nJayne Cortez, poet, born at Fort Huachuca in 1934.\nLieutenant General Robert P. Ashley Jr., served as the Commanding General of the Army Intelligence Center of Excellence and Fort Huachuca from April 2013 to July 2015.\nLieutenant General Scott D. Berrier, served as the Commanding General of the Army Intelligence Center of Excellence and Fort Huachuca from July 2015 to July 2017.\n\n\nIn popular culture\nCaptain Newman, M.D. (1963), starring Gregory Peck as the title character, was filmed at Fort Huachuca.\nThe opening sequence of Suppose They Gave a War and Nobody Came (1969) was filmed at Ft. Huachuca. This movie was supported by the 1st Training Brigade. It stars Brian Keith and Tony Curtis.\nIn Scent of a Woman (1992) starring Al Pacino as Lt. Colonel Frank Slade, Slade tells his companion Charlie Simms that he dreamed of The Oak Room's rolls when he was at Fort Huachuca. \"Bread's no good west of the Colorado. Water's too alkaline.\"\nIn the Tom Clancy thriller, Clear and Present Danger, Fort Huachuca is identified and shown as the place where phone calls between drug lords, Felix Cortez and Ernesto Escobedo, are being intercepted.\nTumbleweed Forts (2021), a memoir by Frank Warner, describes how Frank and his brothers explored Fort Huachuca from 1960 to 1963, when their father was stationed there experimenting with the Army's early drones. Tumbleweed Forts also has been turned into a five-part series, Huachuca Books, adapted for young readers.\n\n\nClimate\n\n\nGallery\n\n\nReferences\n\n\nFurther reading\nSmith, Cornelius C. Jr. Fort Huachuca: The Story of a Frontier Post. Fort Huachuca, Arizona: 1978.\n\n\nExternal links\n\nFort Huachuca Homepage\nFort Huachuca News\nFort Huachuca Apache Flats RV Resort information.\nHistoric Fort Huachuca\nMI History Virtual Tour Archived 17 April 2020 at the Wayback Machine"}}}}